// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

Console.Write("Введите количество строк массива: ");
var rows = int.Parse(Console.ReadLine());

Console.Write("Введите количество столбцов массива: ");
int columns = int.Parse(Console.ReadLine());

int[,] array = GetArrayMatrix(rows, columns, 0, 50);
PrintArray(array);

int[,] GetArrayMatrix(int rows, int columns, int minValue = 0, int maxValue = 50)
{
    int[,] result = new int[rows, columns];
    for (int i = 0; i < rows; i++)
    {
        for (int j = 0; j < columns; j++)
        {
            result[i, j] = new Random().Next(minValue, maxValue + 1);
        }
    }
    return result;
}

void PrintArray(int[,] inArray)
{
    for (int i = 0; i < inArray.GetLength(0); i++)
    {
        for (int j = 0; j < inArray.GetLength(1); j++)
        {
            Console.Write($"{inArray[i, j]} ");
        }
        Console.WriteLine();
    }
}

SummColumns(array);

void SummColumns(int[,] array)
{
    for (int j = 0; j < array.GetLength(0); j++)
    {
        int Summ = 0;
        for (int i = 0; i < array.GetLength(1); i++)
        {
           Summ+=array[i, j];
        }
        Console.WriteLine(Summ);
    }
}
